Terraform Plan for terraform/eus/dev/frontend_asa:

```
data.local_file.fileset_hash["assets/Latin-Merriweather-Italic-025x4r-i.woff2"]: Reading...
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-700-I20238as.woff2"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-SemiBold-SVwjBnfs.woff2"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-Italic-WyqsJash.woff2"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-ExtraLightItalic-DvzEIrpw.woff2"]: Reading...
data.local_file.fileset_hash["index.html"]: Reading...
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-500italic-77bpN8in.woff2"]: Reading...
data.local_file.fileset_hash["assets/Latin-Merriweather-Bold-CCF7lkx7.woff2"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-LightItalic-00lx5OWp.woff2"]: Reading...
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-700-I20238as.woff2"]: Read complete after 0s [id=c8c9d58abd0a9b3e130c19d24dfc61279c9288bf]
data.local_file.fileset_hash["assets/Latin-Merriweather-Italic-025x4r-i.woff2"]: Read complete after 0s [id=06e8df90d6b1c7b4cd12e67530ad0ab9c6f85ef4]
data.local_file.fileset_hash["assets/PublicSans-SemiBold-SVwjBnfs.woff2"]: Read complete after 0s [id=f743c17187ffb5ac9e1f473c7791cb7b250063b9]
data.local_file.fileset_hash["index.html"]: Read complete after 0s [id=397e032444856e5e85a164ce494424eabd9beded]
data.local_file.fileset_hash["favicon.ico"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-ExtraLightItalic-DvzEIrpw.woff2"]: Read complete after 0s [id=92e398e0ffb6d3344af330eb57ea392ec7363ba6]
data.local_file.fileset_hash["assets/PublicSans-SemiBoldItalic-6VEvhiCP.woff2"]: Reading...
data.local_file.fileset_hash["assets/Latin-Merriweather-Bold-CCF7lkx7.woff2"]: Read complete after 0s [id=7c39fdb2b551973b35c65562308100c0f7cd29d1]
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-500italic-77bpN8in.woff2"]: Read complete after 0s [id=e1abfa9ad8409a3fcd308ad6046d563706b17e2e]
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-700italic-XT-YK-RT.woff2"]: Reading...
data.local_file.fileset_hash["assets/index-2DgXCDOF.css"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-MediumItalic-j3tmqO8z.woff2"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-Italic-WyqsJash.woff2"]: Read complete after 0s [id=769102507e673c1956878abfd436d1b605693e82]
data.local_file.fileset_hash["assets/PublicSans-SemiBoldItalic-6VEvhiCP.woff2"]: Read complete after 0s [id=4d39fdce81973f7b552871f67a9ab6318f027804]
data.local_file.fileset_hash["assets/PublicSans-LightItalic-00lx5OWp.woff2"]: Read complete after 0s [id=a9faf2ef20561b7708e1ae6b2d0b9383a0a4005a]
data.local_file.fileset_hash["favicon.ico"]: Read complete after 0s [id=1120538c77ad1f28a89243b4b53fe2ac16cc3bc6]
data.local_file.fileset_hash["assets/PublicSans-Medium-zQ6fq27c.woff2"]: Reading...
data.local_file.fileset_hash["assets/sprite-5LGWy5xd.svg"]: Reading...
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-700italic-XT-YK-RT.woff2"]: Read complete after 0s [id=cf07faf60a4563d0527a157f4c5177d3f5040d9a]
data.local_file.fileset_hash["assets/Latin-Merriweather-Regular-cMHUZnTa.woff2"]: Reading...
data.local_file.fileset_hash["logo512.png"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-Bold-4lh402Lw.woff2"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-BoldItalic-Jq1RgZyv.woff2"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-MediumItalic-j3tmqO8z.woff2"]: Read complete after 0s [id=e9c3b9cfe29618a3f639c611bb22e4ce85c66e87]
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-300-CIuXmEDd.woff2"]: Reading...
data.local_file.fileset_hash["assets/OPRE_Logo-QQy68Yrd.png"]: Reading...
data.local_file.fileset_hash["logo512.png"]: Read complete after 0s [id=46915f9d02694ed49bfc7a9534947684103dc3fe]
data.local_file.fileset_hash["assets/Latin-Merriweather-Regular-cMHUZnTa.woff2"]: Read complete after 0s [id=1ae84638ff79188bbdd85f4ea0c09429c7539093]
data.local_file.fileset_hash["assets/PublicSans-BoldItalic-Jq1RgZyv.woff2"]: Read complete after 0s [id=18c78fc89624b2de976c8ba8ebc2049d0f1f6461]
data.local_file.fileset_hash["assets/OPRE_Logo-QQy68Yrd.png"]: Read complete after 0s [id=48b7d2edfe39bc53679eef71bc2e0983c654b4eb]
data.local_file.fileset_hash["assets/PublicSans-Medium-zQ6fq27c.woff2"]: Read complete after 0s [id=394246985ddf41a155c40bb054dd15cc0a0e2695]
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-300italic-GqlOrwfO.woff2"]: Reading...
data.local_file.fileset_hash["assets/sprite-5LGWy5xd.svg"]: Read complete after 0s [id=cabaf08f1c43ebcf76617fd04272c37fe43d1526]
data.local_file.fileset_hash["manifest.json"]: Reading...
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-regular-5TJ47K95.woff2"]: Reading...
data.local_file.fileset_hash["assets/hhs-logo-fGpBCi7U.jpg"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-Bold-4lh402Lw.woff2"]: Read complete after 0s [id=302902d53fdc0df9e167b5db0139263ac3705ed0]
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-300italic-GqlOrwfO.woff2"]: Read complete after 0s [id=07654da9c45219e33a8c88868bbdfc7852075bec]
data.local_file.fileset_hash["logo192.png"]: Reading...
data.local_file.fileset_hash["manifest.json"]: Read complete after 0s [id=b9bdb03cd54fd09f9f8b7bf646422f74b5afb9b1]
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-regular-5TJ47K95.woff2"]: Read complete after 0s [id=64ea64bc9e5b805e5c4e846d29525c94eb275b50]
data.local_file.fileset_hash["assets/Latin-Merriweather-BoldItalic-JQDcMnUg.woff2"]: Reading...
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-300-CIuXmEDd.woff2"]: Read complete after 0s [id=78af81633bc6dd07e30f81022fc42cf02949ed6a]
data.local_file.fileset_hash["assets/Latin-Merriweather-LightItalic-fzuv9GcB.woff2"]: Reading...
data.local_file.fileset_hash["assets/hhs-logo-fGpBCi7U.jpg"]: Read complete after 0s [id=2d01b78b1fae2e5ca23418355e8bc6240167e18a]
data.local_file.fileset_hash["assets/hero-PagYR-AW.jpg"]: Reading...
data.local_file.fileset_hash["logo192.png"]: Read complete after 0s [id=7f4f2d68782a7fafceda84554ecab9b489877500]
data.local_file.fileset_hash["assets/PublicSans-ExtraLight-RJsedfk8.woff2"]: Reading...
data.local_file.fileset_hash["assets/Latin-Merriweather-BoldItalic-JQDcMnUg.woff2"]: Read complete after 0s [id=b8ec6067307a948965e19f6c2caae4ea1679b02e]
data.local_file.fileset_hash["robots.txt"]: Reading...
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-500-qqdFr_9E.woff2"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-Regular-FMOTWH4z.woff2"]: Reading...
data.local_file.fileset_hash["assets/Latin-Merriweather-Light-PDnE-7rh.woff2"]: Reading...
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-italic-M8YJkiXM.woff2"]: Reading...
data.local_file.fileset_hash["assets/hero-PagYR-AW.jpg"]: Read complete after 0s [id=f38f28109e2cdd9117af6298acddd8d137a66e4e]
data.local_file.fileset_hash["assets/Latin-Merriweather-LightItalic-fzuv9GcB.woff2"]: Read complete after 0s [id=641b83f081569a6007cad9d6cb8be6f59bd75140]
data.local_file.fileset_hash["assets/Latin-Merriweather-Light-PDnE-7rh.woff2"]: Read complete after 0s [id=d195cd29956095f88d74b2cf5af28bcd11a01916]
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-italic-M8YJkiXM.woff2"]: Read complete after 0s [id=f84197395673cb89dc3e58ab1ce5cad53415e96c]
data.local_file.fileset_hash["robots.txt"]: Read complete after 0s [id=044ce68f83ee8543475fea16f6e3a73d28a1c6d5]
data.local_file.fileset_hash["assets/roboto-mono-v5-latin-500-qqdFr_9E.woff2"]: Read complete after 0s [id=269a453bdc9ca0011cf092aa1fdba665750f0706]
data.local_file.fileset_hash["assets/index-2DgXCDOF.css"]: Read complete after 0s [id=6b4b5c41f88d622c09fd1af4576914cb17191ba4]
data.local_file.fileset_hash["assets/PublicSans-Regular-FMOTWH4z.woff2"]: Read complete after 0s [id=93baedc58d1dd21188fe6da8a059df9872beeaa0]
data.local_file.fileset_hash["assets/PublicSans-Light-s9w0BL14.woff2"]: Reading...
data.local_file.fileset_hash["assets/index-z323APS9.js"]: Reading...
data.local_file.fileset_hash["assets/PublicSans-ExtraLight-RJsedfk8.woff2"]: Read complete after 0s [id=fc54e61d9ca3f507c9a0af5f3c5084af190ef876]
data.local_file.fileset_hash["assets/PublicSans-Light-s9w0BL14.woff2"]: Read complete after 0s [id=02e9cdfd6b98f95356c00808adbe213d7b6ffd39]
data.local_file.fileset_hash["assets/index-z323APS9.js"]: Read complete after 0s [id=96e7549d527f84b5e83f3d1050dff4c288487e25]
data.azurerm_container_app_environment.aca_env: Reading...
data.azurerm_storage_account.static_fe: Reading...
azurerm_storage_blob.site["assets/PublicSans-Bold-4lh402Lw.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-Bold-4lh402Lw.woff2]
azurerm_storage_blob.site["assets/Latin-Merriweather-BoldItalic-JQDcMnUg.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/Latin-Merriweather-BoldItalic-JQDcMnUg.woff2]
azurerm_storage_blob.site["assets/index-iH3yRdud.js"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-iH3yRdud.js]
azurerm_storage_blob.site["assets/Latin-Merriweather-Italic-025x4r-i.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/Latin-Merriweather-Italic-025x4r-i.woff2]
azurerm_storage_blob.site["assets/roboto-mono-v5-latin-regular-5TJ47K95.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/roboto-mono-v5-latin-regular-5TJ47K95.woff2]
azurerm_storage_blob.site["assets/Latin-Merriweather-Bold-CCF7lkx7.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/Latin-Merriweather-Bold-CCF7lkx7.woff2]
azurerm_storage_blob.site["assets/hero-PagYR-AW.jpg"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/hero-PagYR-AW.jpg]
azurerm_storage_blob.site["logo192.png"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/logo192.png]
data.azurerm_storage_account.static_fe: Read complete after 0s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.Storage/storageAccounts/opreopsdeveussfest]
azurerm_storage_blob.site["assets/PublicSans-ExtraLight-RJsedfk8.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-ExtraLight-RJsedfk8.woff2]
data.azurerm_container_app_environment.aca_env: Read complete after 0s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae]
azurerm_storage_blob.site["manifest.json"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/manifest.json]
azurerm_storage_blob.site["assets/roboto-mono-v5-latin-300-CIuXmEDd.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/roboto-mono-v5-latin-300-CIuXmEDd.woff2]
azurerm_storage_blob.site["assets/hhs-logo-fGpBCi7U.jpg"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/hhs-logo-fGpBCi7U.jpg]
azurerm_storage_blob.site["assets/PublicSans-Regular-FMOTWH4z.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-Regular-FMOTWH4z.woff2]
azurerm_storage_blob.site["assets/roboto-mono-v5-latin-700italic-XT-YK-RT.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/roboto-mono-v5-latin-700italic-XT-YK-RT.woff2]
azurerm_storage_blob.site["assets/Latin-Merriweather-Light-PDnE-7rh.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/Latin-Merriweather-Light-PDnE-7rh.woff2]
azurerm_storage_blob.site["assets/PublicSans-Medium-zQ6fq27c.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-Medium-zQ6fq27c.woff2]
azurerm_storage_blob.site["assets/roboto-mono-v5-latin-500italic-77bpN8in.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/roboto-mono-v5-latin-500italic-77bpN8in.woff2]
azurerm_storage_blob.site["assets/PublicSans-SemiBoldItalic-6VEvhiCP.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-SemiBoldItalic-6VEvhiCP.woff2]
azurerm_storage_blob.site["logo512.png"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/logo512.png]
azurerm_storage_blob.site["assets/PublicSans-Light-s9w0BL14.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-Light-s9w0BL14.woff2]
azurerm_storage_blob.site["assets/roboto-mono-v5-latin-500-qqdFr_9E.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/roboto-mono-v5-latin-500-qqdFr_9E.woff2]
azurerm_storage_blob.site["assets/roboto-mono-v5-latin-300italic-GqlOrwfO.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/roboto-mono-v5-latin-300italic-GqlOrwfO.woff2]
azurerm_storage_blob.site["assets/index-2DgXCDOF.css"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-2DgXCDOF.css]
azurerm_storage_blob.site["assets/PublicSans-Italic-WyqsJash.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-Italic-WyqsJash.woff2]
azurerm_storage_blob.site["assets/OPRE_Logo-QQy68Yrd.png"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/OPRE_Logo-QQy68Yrd.png]
azurerm_storage_blob.site["assets/Latin-Merriweather-Regular-cMHUZnTa.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/Latin-Merriweather-Regular-cMHUZnTa.woff2]
azurerm_storage_blob.site["assets/sprite-5LGWy5xd.svg"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/sprite-5LGWy5xd.svg]
azurerm_storage_blob.site["assets/roboto-mono-v5-latin-700-I20238as.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/roboto-mono-v5-latin-700-I20238as.woff2]
azurerm_storage_blob.site["favicon.ico"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/favicon.ico]
azurerm_storage_blob.site["assets/PublicSans-BoldItalic-Jq1RgZyv.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-BoldItalic-Jq1RgZyv.woff2]
azurerm_storage_blob.site["assets/PublicSans-SemiBold-SVwjBnfs.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-SemiBold-SVwjBnfs.woff2]
azurerm_storage_blob.site["index.html"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/index.html]
azurerm_storage_blob.site["assets/roboto-mono-v5-latin-italic-M8YJkiXM.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/roboto-mono-v5-latin-italic-M8YJkiXM.woff2]
azurerm_storage_blob.site["assets/PublicSans-ExtraLightItalic-DvzEIrpw.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-ExtraLightItalic-DvzEIrpw.woff2]
azurerm_storage_blob.site["robots.txt"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/robots.txt]
azurerm_storage_blob.site["assets/PublicSans-LightItalic-00lx5OWp.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-LightItalic-00lx5OWp.woff2]
azurerm_storage_blob.site["assets/PublicSans-MediumItalic-j3tmqO8z.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/PublicSans-MediumItalic-j3tmqO8z.woff2]
azurerm_storage_blob.site["assets/Latin-Merriweather-LightItalic-fzuv9GcB.woff2"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/Latin-Merriweather-LightItalic-fzuv9GcB.woff2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_storage_blob.site["assets/index-iH3yRdud.js"] will be destroyed
  # (because key ["assets/index-iH3yRdud.js"] is not in for_each map)
  - resource "azurerm_storage_blob" "site" {
      - access_tier            = "Hot" -> null
      - content_md5            = "7bfc08ea7c58b84798c694fc18bb9e21" -> null
      - content_type           = "application/javascript" -> null
      - id                     = "https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-iH3yRdud.js" -> null
      - metadata               = {} -> null
      - name                   = "assets/index-iH3yRdud.js" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "../../../../frontend/build/assets/index-iH3yRdud.js" -> null
      - storage_account_name   = "opreopsdeveussfest" -> null
      - storage_container_name = "$web" -> null
      - type                   = "Block" -> null
      - url                    = "https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-iH3yRdud.js" -> null
    }

  # azurerm_storage_blob.site["assets/index-z323APS9.js"] will be created
  + resource "azurerm_storage_blob" "site" {
      + access_tier            = (known after apply)
      + content_md5            = "972560b9838f28e4dcb1ab38c27d5287"
      + content_type           = "application/javascript"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/index-z323APS9.js"
      + parallelism            = 8
      + size                   = 0
      + source                 = "../../../../frontend/build/assets/index-z323APS9.js"
      + storage_account_name   = "opreopsdeveussfest"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.site["index.html"] must be replaced
-/+ resource "azurerm_storage_blob" "site" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "b48272d12808358254e4da14538fd854" -> "14ed0b7fbebe206db8e327631cb74d26" # forces replacement
      ~ id                     = "https://opreopsdeveussfest.blob.core.windows.net/$web/index.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "index.html"
      ~ url                    = "https://opreopsdeveussfest.blob.core.windows.net/$web/index.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

Plan saved to GH artifacts.